{
    "types": [
        {
            "id": 0,
            "name": "Bisseção",
            "input": [
                {
                    "id": 0,
                    "name": "Erro de truncamento",
                    "type": "number"
                },
                {
                    "id": 1,
                    "name": "Primeiro valor do intervalo",
                    "type": "number"
                },
                {
                    "id": 2,
                    "name": "Segundo valor do intervalo",
                    "type": "number"
                }
            ],
            "description": "O método da bissecção é inteiramente baseado no Teorema do Valor Intermediário, ele garante a existência de uma solução para f(x) = 0 no intervalo (a, b) desde que f : [a, b] → R seja contínua e satisfaz f(a) * f(b) < 0. "
        },
        {
            "id": 1,
            "name": "newton",
            "input": [
                {
                    "id": 0,
                    "name": "Erro de truncamento",
                    "type": "number"
                },
                {
                    "id": 1,
                    "name": "Intervalo a",
                    "type": "number"
                },
                {
                    "id": 2,
                    "name": "Intervalo b",
                    "type": "number"
                },
                {
                    "id": 3,
                    "name": "Valor de X0",
                    "type": "number"
                }
            ],
            "description": "O método de Newton-Raphson tem o objetivo de estimar as raízes de uma função, e é um dos métodos mais eficientes para a solução numérica de f(x) = 0. Escolhe-se uma aproximação inicial para esta. Como veremos, esse método possui ordem de convergência 2. Onde o algoritmo é dado por Xn+1 = Xn - f(Xn) / f'(Xn) e o critério de parada se dá por |Xn+1 - Xn| <= Erro de truncamento"
        },
        {
            "id": 2,
            "name": "lagrange",
            "input": [
                {
                    "id": 0,
                    "x": "1.3",
                    "y": "3.2"
                },
                {
                    "id": 1,
                    "x": "1.8",
                    "y": "4.3"
                },
                {
                    "id": 2,
                    "x": "2.6",
                    "y": "0.5"
                },
                {
                    "id": 3,
                    "x": "3.9",
                    "y": "-1.7"
                }
            ],
            "description": "O método de Lagrange, um método de interpolação, encontrando um polinômio que passa por todos os pontos, e a maneira de calcular é um pouco complexa, mas nada de outro mundo. Utilizamos a fórmula: f(x) = L(0)*f(x0) + L(1) * f(x1) + L(2) * f(x2)..., e assim sucessivamente, até N-1 do polinômio pedido, caso o polinômio que estivesse sendo interpolado fosse do grau 3, teria L(3) = L(0) * f(x0) + L(1) * f(x1) + L(2) * f(x2). Em que o problema todo, consiste em acharmos os valores de L(n), pois os outros valores já são dados, e esses L são calculados da seguinte forma: Caso tivessem x0, x1 e x2, o L(0) é: (x - x1) * (x - x2) / (x0 - x1) * (x0 - x2), onde no denomidador, inicia-se com o próprio (Xn) subtraindo pelos valores que não são ele mesmo, para que não haja problema de zerar o denominador e causar uma indeterminação matemática, e no numerador é (X - (os valores repetidos do denomidador do lado direito do sinal de subtração)), e assim será feito para achar o L(0), O L(1) e o L(2). Achando esses valores basta substituir todos os valores em seus devidos lugares dentro da equação. Não havendo o erro de conta, chegaremos ao polinômio interpolador de Lagrange. Em seguida mostraremos esse método na prática para vocês."
        }   
    ]
}